In [1]:
#import
import numpy as np
import pandas as pd

In [4]:
#OBJECT CREATION
#create series, default index integer ditentukan pandas
s = pd.Series([1,3,5,np.nan,6,8])
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [5]:
#buat dataframe dgn numpy array berisi index datetime dan nama kolom
dates = pd.date_range('20130101', periods=6)
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [6]:
df = pd.DataFrame(np.random.randn(6,4), index=dates, columns=list('ABCD'))
df

                   A         B         C         D
2013-01-01 -1.576284  1.716502  1.124050  1.352319
2013-01-02  0.601328  2.621603 -0.628141  0.261687
2013-01-03  0.947648 -0.759830 -0.386792 -0.655074
2013-01-04  1.182956 -0.499004  0.785344  2.699681
2013-01-05  0.234463  1.861980 -0.215536  0.595377
2013-01-06  0.741808 -1.911088 -0.846332  0.131040

In [8]:
#buat dataframe berisi objek dalam dictionary yg bisa dikonversi menjadi series
df2= pd.DataFrame({'A':1.,
                'B':pd.Timestamp('20130102'),
                'C':pd.Series(1, index=list(range(4)), dtype='float32'),
                'D':np.array([3] * 4, dtype='int32'),
                'E':pd.Categorical(['test','train','test','train']),
                'F':'foo'
                })
df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [11]:
#hasil dataframe tipe tiap kolom
df2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

In [12]:
#VIEWING DATA
#lihat baris teratas dan terbawah dalam frame
df.head()

                   A         B         C         D
2013-01-01 -1.576284  1.716502  1.124050  1.352319
2013-01-02  0.601328  2.621603 -0.628141  0.261687
2013-01-03  0.947648 -0.759830 -0.386792 -0.655074
2013-01-04  1.182956 -0.499004  0.785344  2.699681
2013-01-05  0.234463  1.861980 -0.215536  0.595377

In [13]:
df.tail(3)

                   A         B         C         D
2013-01-04  1.182956 -0.499004  0.785344  2.699681
2013-01-05  0.234463  1.861980 -0.215536  0.595377
2013-01-06  0.741808 -1.911088 -0.846332  0.131040

In [14]:
#display index
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [15]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [17]:
#buat df jadi array numpy tanpa index dan label hanya data nya saja
df.to_numpy()

array([[-1.57628364,  1.7165016 ,  1.1240499 ,  1.3523185 ],
       [ 0.60132827,  2.62160295, -0.62814138,  0.26168698],
       [ 0.94764754, -0.75983006, -0.38679178, -0.65507439],
       [ 1.18295633, -0.49900388,  0.78534434,  2.69968116],
       [ 0.23446269,  1.86198038, -0.21553553,  0.59537679],
       [ 0.74180815, -1.91108778, -0.8463322 ,  0.1310396 ]])

In [18]:
df2.to_numpy()

array([[1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'test', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'test', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train', 'foo']],
      dtype=object)

In [19]:
#describe() : tampilkan summary statistik dari data
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean   0.355320  0.505027 -0.027901  0.730838
std    0.999142  1.801912  0.797808  1.164607
min   -1.576284 -1.911088 -0.846332 -0.655074
25%    0.326179 -0.694624 -0.567804  0.163701
50%    0.671568  0.608749 -0.301164  0.428532
75%    0.896188  1.825611  0.535124  1.163083
max    1.182956  2.621603  1.124050  2.699681

In [20]:
#transpose data
df.T

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A   -1.576284    0.601328    0.947648    1.182956    0.234463    0.741808
B    1.716502    2.621603   -0.759830   -0.499004    1.861980   -1.911088
C    1.124050   -0.628141   -0.386792    0.785344   -0.215536   -0.846332
D    1.352319    0.261687   -0.655074    2.699681    0.595377    0.131040

In [21]:
#urutkan data berdasarkan sumbu (membalik nilai kolomnya)
df.sort_index(axis=1, ascending=False)

                   D         C         B         A
2013-01-01  1.352319  1.124050  1.716502 -1.576284
2013-01-02  0.261687 -0.628141  2.621603  0.601328
2013-01-03 -0.655074 -0.386792 -0.759830  0.947648
2013-01-04  2.699681  0.785344 -0.499004  1.182956
2013-01-05  0.595377 -0.215536  1.861980  0.234463
2013-01-06  0.131040 -0.846332 -1.911088  0.741808

In [22]:
#urutkan berdasarkan nilai
df.sort_values(by='B')

                   A         B         C         D
2013-01-06  0.741808 -1.911088 -0.846332  0.131040
2013-01-03  0.947648 -0.759830 -0.386792 -0.655074
2013-01-04  1.182956 -0.499004  0.785344  2.699681
2013-01-01 -1.576284  1.716502  1.124050  1.352319
2013-01-05  0.234463  1.861980 -0.215536  0.595377
2013-01-02  0.601328  2.621603 -0.628141  0.261687

In [23]:
#GETTING
#ambil 1 kolom yg menghasil kan Series dan ekuivalen dengandf.A
df['A']

2013-01-01   -1.576284
2013-01-02    0.601328
2013-01-03    0.947648
2013-01-04    1.182956
2013-01-05    0.234463
2013-01-06    0.741808
Freq: D, Name: A, dtype: float64

In [24]:
#ambil lewat [], dengan menulikan posisi nya
df[0:3]

                   A         B         C         D
2013-01-01 -1.576284  1.716502  1.124050  1.352319
2013-01-02  0.601328  2.621603 -0.628141  0.261687
2013-01-03  0.947648 -0.759830 -0.386792 -0.655074

In [25]:
df['20130102':'20130104']

                   A         B         C         D
2013-01-02  0.601328  2.621603 -0.628141  0.261687
2013-01-03  0.947648 -0.759830 -0.386792 -0.655074
2013-01-04  1.182956 -0.499004  0.785344  2.699681

In [38]:
#SELECTION By LABEL
#getting cross using label
df.loc[dates[0]]

A   -1.576284
B    1.716502
C    1.124050
D    1.352319
Name: 2013-01-01 00:00:00, dtype: float64

In [39]:
#select multi axis by label
df.loc[:, ['A','B']]

                   A         B
2013-01-01 -1.576284  1.716502
2013-01-02  0.601328  2.621603
2013-01-03  0.947648 -0.759830
2013-01-04  1.182956 -0.499004
2013-01-05  0.234463  1.861980
2013-01-06  0.741808 -1.911088

In [40]:
#Showing label slicing, both endpoints are included
df.loc['20130102':'20130104',['A','B']]

                   A         B
2013-01-02  0.601328  2.621603
2013-01-03  0.947648 -0.759830
2013-01-04  1.182956 -0.499004

In [41]:
#Reduction in the dimensions of the returned object
df.loc['20130102',['A','B']]

A    0.601328
B    2.621603
Name: 2013-01-02 00:00:00, dtype: float64